# `na_filter` & `keep_default_na`

In [1]:
import pandas as pd

In [3]:
df_student = pd.read_csv("./datasets/df_na_nav.csv", na_values="not available")

In [4]:
df_student

       Name  Score Grades
0      Paul   98.0    NaN
1     Aaron    NaN     AB
2    Krista   99.0     AA
3  Veronica   87.0    NaN
4    Paxton   90.0     AC
5   Madison    NaN     BA
6    Aurora   82.0     BB

In [5]:
df_student = pd.read_csv("./datasets/df_na_nav.csv", na_values="not available", keep_default_na=False)

In [6]:
df_student

       Name Score Grades
0      Paul    98    NaN
1     Aaron    NA     AB
2    Krista    99     AA
3  Veronica    87     NA
4    Paxton    90     AC
5   Madison    NA     BA
6    Aurora    82     BB

In [7]:
df_student = pd.read_csv("./datasets/df_na_nav.csv", na_values="not available", na_filter=True)

df_student

       Name  Score Grades
0      Paul   98.0    NaN
1     Aaron    NaN     AB
2    Krista   99.0     AA
3  Veronica   87.0    NaN
4    Paxton   90.0     AC
5   Madison    NaN     BA
6    Aurora   82.0     BB